of70/tutorials/rheoEFoam/EKI/Ohmic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletNorth
    {
	type            fixedValue;
	value           uniform 0;
    }
    
    inletSouth
    {
	type            fixedValue;
	value           uniform 0;
    }
    
    inletWest
    {
	type            fixedValue;
	value           uniform 0;
    }
       
    "(walls|frontAndBack)"
    {
	type            zeroGradient;       
    }

    outlet
    {
	type            fixedValue;
	value           uniform 0;      
    }
}

// ************************************************************************* //
